In [1]:
file_path = './data/customers.csv'

In [2]:
import pandas as pd

In [11]:
df = pd.read_csv("data/smalldata.csv",
                names = ["Age", "Weight", "Gender", "Name"],
                skiprows = 1)

In [12]:
df

   Age  Weight Gender    Name
0   15      70      M     Bob
1   18      50      F   Alice
2   15      55      F   Maria
3   12      85      M    John
4   14      68      M   Kevin
5   20     110      M  Donald

In [14]:
df.index = ["1st", "2nd","3rd",
            "4th","5th","6th"]

In [15]:
df

     Age  Weight Gender    Name
1st   15      70      M     Bob
2nd   18      50      F   Alice
3rd   15      55      F   Maria
4th   12      85      M    John
5th   14      68      M   Kevin
6th   20     110      M  Donald

In [7]:
df["Age + 10"] = df["Age"] + df["Weight"]

In [23]:
df["Weight in pounds"] = df["Weight"] * 0.453592

In [24]:
df.loc[["2nd", "5th"], :]

     Age  Weight Gender   Name  Weight in pounds
2nd   18      50      F  Alice         22.679600
5th   14      68      M  Kevin         30.844256

In [25]:
df.iloc[[3,5],[0,1]]

     Age  Weight
4th   12      85
6th   20     110

In [27]:
df.query("Age > 15 & Gender == 'M'")

     Age  Weight Gender    Name  Weight in pounds
6th   20     110      M  Donald          49.89512

In [36]:
df.describe([.1, .5, .9])

             Age      Weight  Weight in pounds
count   6.000000    6.000000          6.000000
mean   15.666667   73.000000         33.112216
std     2.875181   21.908902          9.937703
min    12.000000   50.000000         22.679600
10%    13.000000   52.500000         23.813580
50%    15.000000   69.000000         31.297848
90%    19.000000   97.500000         44.225220
max    20.000000  110.000000         49.895120

In [40]:
ages = {'name': ['alice', 'bob'], 'age': [28, 25]}
homes = {'name': ['alice', 'bob'], 'home': ['London', 'Rome']}
df_ages = pd.DataFrame(ages) 
df_homes = pd.DataFrame(homes)

In [41]:
df_ages

    name  age
0  alice   28
1    bob   25

In [42]:
df_homes

    name    home
0  alice  London
1    bob    Rome

In [44]:
df_ages.merge(df_homes, left_on='name', right_on='name')

    name  age    home
0  alice   28  London
1    bob   25    Rome

In [45]:
df["Age"] > 15

1st    False
2nd     True
3rd    False
4th    False
5th    False
6th     True
Name: Age, dtype: bool

In [49]:
mask_15 = df["Age"] > 15
mask_male = df["Gender"] == "M"

In [54]:
df.loc[mask_15 | mask_male, :]

     Age  Weight Gender    Name  Weight in pounds
1st   15      70      M     Bob         31.751440
2nd   18      50      F   Alice         22.679600
4th   12      85      M    John         38.555320
5th   14      68      M   Kevin         30.844256
6th   20     110      M  Donald         49.895120

In [56]:
df2 = df.loc[mask_15 | mask_male, :]

In [57]:
df2.to_csv("my_new_file.csv")